# -*- coding: utf-8 -*-
"""
Created on Thu Apr  3 18:35:49 2025

@author: Student
"""

VERSION = '0.2'
ICON_PATH = "gui/resources/icon.ico"

# Содержит tooltips подсказки при наведении мышкой
TIPS = {
        # 1. refresh button
        'refresh_button': 'При нажатии применяет выставленные параметры',
        # 2. zoom out button
        'zoom_out_button': 'При нажатии отдаляет график до изначальных границ, \
при этом применяет выставленные параметры',
        # 3. probe
        'probe': "Список выбора номера зонда",
        # 4. u_range
        'u_range': {
            'u_min': "Диапазон напряжения на АЧХ, левая граница [В]",
            'u_max': "Диапазон напряжения на АЧХ, правая граница [В]"
            },
        # 5. lni_range
        'lni_range': {
            'lni_min': "Диапазон по логарифму тока зонда на АЧХ, нижняя граница",
            'lni_max': "Диапазон по логарифму тока зонда на АЧХ, верхняя граница"
            },
        # 6. n_avg
        'n_avg': "Число соседних сканов для обработки (скользящее окно)",
        # 7. te_threshold
        'te_threshold': "Ограничение максимального значения Te, \
превышающие значения будут обнулены",
        # 8. sweep_direction
        'sweep_direction': {
            'up': "Построение АЧХ по подъёму тока",
            'down': "Построение АЧХ по спаду тока"
            },
        # 9. probe_area
        'probe_area': "Площадь зонда [мм^2], Для примерного расчёта: S_probe * sin(α)",
        # 10. smooth_u
        'smooth_u': {
            'avg': "Сглаживание входного сигнала напряжения, размер окна",
            'n': "Сглаживание входного сигнала напряжения, количество проходов"
            },
        # 11. smooth_i
        'smooth_i': {
            'avg': "Сглаживание входного сигнала тока зонда, размер окна",
            'n': "Сглаживание входного сигнала тока зонда, количество проходов"
            },
        # 12. dt_range_ne
        'dt_range_ne': {
            'dt_ne_min': "Временной диапазон для выбора полки на токе зонда, \
нужен для определения плотности, левая граница, увеличение параметра сдвигает \
границу красной области вправо",
            'dt_ne_max':  "Временной диапазон для выбора полки на токе зонда, \
нужен для определения плотности, правая граница, увеличение параметра сдвигает \
границу красной области влево",
            },
        # 13. dt_range_te
        'dt_range_te': {
            'dt_te_min': "Временной диапазон для выбора зоны построения АЧХ, \
левая граница, увеличение параметра сдвигает границу зеленой области вправо",
            'dt_te_max':  "Временной диапазон для выбора зоны построения АЧХ, \
правая граница, увеличение параметра сдвигает границу зеленой области влево",
            },
        }

# Содержит текст инструкций и информацию для окон
INFO = {
        'main_window_title': f"Зонды Ленгмюра {VERSION}",

        # Текст о программе для главного окна
        'main_window_about': {
            'window_title': 'О программе',
            'text': f"Программа для определения электронной температуры, \
электронной плотности по данным зондов Ленгмюра\nВерсия: {VERSION}\nАвтор: \
Аммосов Я.М."
            },

        # Текст инструкции для главного окна
        'main_window_instruction': {
            'window_title': 'Инструкция',
            'text': '1. Загрузите данные через конфигуратор\n2. Редактируйте \
параметры расчёта\n3. Кнопка "Обновить", клавиша Enter для подтверждения \
заданных параметров\n5. Кнопка "Отдалить" применяет заданные параметры и \
отдаляет приближение сделанное с помощью иструментов приближения\n5. С помощью \
сочетания "CTRL+Левая кнопка мыши" нажимая на график Te можно открыть ВАХ\n\
6. Через меню Файл -> Сохранить можно сохранить данные\n7. Наведите мышь на \
любой из параметров, чтобы узнать больше'
            },
        # Текст инструкции для окна конфигуратора
        'configurator_instruction': {
            'window_title': 'Инструкция',
            'text': '1. Укажите путь к TDMS файлу\n2. \
Сопоставьте номера зондов с номерами каналов TDMS файла используя ключевое \
слово "channel", добавьте к каждому каналу соответствующий множитель "factor". \
Используйте 2 пробела в качестве отступов и двоеточия для задания параметров.\
\n\nПринятые обозначения:\n"LP.Power" - напряжение,\n"LP.*" - номер зонда для \
расчета Te и ne,\n"LP.*.FP" - сигнал для сохранения в качестве значений \
плавающего потенциала, где * - номер зонда (01, 09, 10, 13).\n\
\nПример (можно скопировать, вставить в поле "Сигналы" для дальнейшего \
редактирования):\n\
LP.Power:\n  channel: LP.15\n  factor: -34\nLP.09:\n  channel: LP.09\n  \
factor: 1000 / 50\nLP.13:\n  channel: LP.03\n  factor: 1000 / 100\n\
LP.13.FP:\n  channel: LP.03\n  factor: 1000 / 100'
            },

        }
